Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: Thus, the increase is actually from 33 to 51 bytes (roughly).
ja: そのため, 実際の増大は, (おおまかにいって)33 byte から 51 byteになる.

source: 52 XCASE Enable input and output of uppercase characters by preceding their lowercase equivalents with "\".
ja: 52 XCASE (訳注: 小文字のみ有効な場合に)小文字の前に "\" を付けることで大文字の入出力を有効にする.Enable input and output of uppercase characters by preceding their lowercase equivalents with "\".

source: End Point Security .................................24 9.5.2.
ja: エンドポイントのセキュリティ .......................24 9.5.2.

source: If the server's final call to GSS_Accept_sec_context() (resulting in a major_status code of GSS_S_COMPLETE) returns a non-zero-length token to be sent to the client, it sends the following:
ja: サーバの最後の (major_status コードが GSS_S_COMPLETE となった) GSS_Accept_sec_context() 呼び出しが クライアントに送るための0でない長さのトークンを返したら, サーバは以下を送る:

source: ECDH Key Exchange ...............................................5 5.
ja: ECDH 鍵交換 ...............................................5 5.

source: This will be needed when processing an incoming message.
ja: 受信メッセージの処理に必要となる.

source: The message below is used by the server to inform the client when it can or cannot perform flow control (control-S/control-Q processing).
ja: 以下のメッセージは, サーバがクライアントにフロー制御が(Control-S/Control-Qを処理して)実行できるかどうかを知らせるのに使われる.

source: Although some weaknesses have been discovered in the predecessor, SHA-1, no weaknesses in the SHA2 family are known at present.
ja: 先祖であるSHA-1にはいくつかの弱点が見つかっているが, SHA2ファミリには現在弱点は知られていない.

source: IANA Considerations .............................................4 6.
ja: INANの考慮 .............................................4 6.

source: SSH packets have message numbers in the range 1 to 255.
ja: SSHのパケットは, 1 から 255 の範囲のメッセージ番号を持つ.

source: IANA Considerations
ja: IANA の考慮

source: The NETCONF client can parse this message to determine which NETCONF capabilities are supported by the NETCONF server.
ja: NETCONF クライアントはこのメッセージをパースして, どの NETCONF 機能がサーバでサポートされているかを判断できる.

source: The use of security services provided by Secure Shell is the approach commonly used for the CLI and is the approach being adopted for use with NETCONF [RFC4742].
ja: セキュアシェルで提供されるセキュリティサービスの利用は, NETCONF[RFC4742] を利用するのに採用された広く用いられているCLIのアプローチがある.

source: The following table identifies the initial assignments of the Public Key Subsystem status code values.
ja: 次の表で, 公開鍵サブシステムの状態コードの値の初期の割り当てを示す.

source: If this is allowed to happen, then the clients will form client-to-attacker sessions, and the attacker will form attacker-to-server sessions and will be able to monitor and manipulate all of the traffic between the clients and the legitimate servers.
ja: こうなると, クライアントはクライアント-攻撃者のセッションを作り, 攻撃者は攻撃者-サーバのセッションを作る. そして, 攻撃者はクライアントと正当なサーバのトラフィックを監視したり操作したりできるようになる.

source: The lack of a similar facility in the SSH session channel has forced users to continue the use of Telnet for the "Console Server" function.
ja: SSH セッションチャンネルで似た機能がないことは, "Console Server"機能のためにTelnetを用い続けることをユーザに強いてきた.

source: Note that since this algorithm only has an effective key length of 112 bits ([SCHNEIER]), it does not meet the specifications that SSH encryption algorithms should use keys of 128 bits or more.
ja: このアルゴリズムは, 112 bitの有効な鍵長しか持たないので ([SCHNEIER]), SSH の暗号アルゴリズムは128bit以上の鍵を使うべきという仕様に合致しない.

source: If the SSH connection does not terminate on a physical serial port, the BREAK indication SHOULD be handled in a manner consistent with the general use of BREAK as an attention/interrupt signal; for instance, a service processor that requires an out-of-band facility to get the attention of a system it manages.
ja: SSH 接続が物理シリアルポートで終了されないなら, BREAKの表示は, 注意/割り込みのシグナルとしてのBREAKの一般的な利用法と合致する方法で取り扱わなければならない. 例えば, 管理するシステムの注意を引くために帯域外の機能を要求するサービスプロセッサだ.

source: Processing Binary Packets in AES-GCM Secure Shell ...............7 7.1.
ja: AES-GCM セキュアシェルのバイナリパケットの処理 ...............7 7.1.

source: SSH provides a number of mechanisms for verification of the identity of the SSH client-side principal using the Secure Shell Authentication Protocol [RFC4252].
ja: SSH は セキュアシェル認証プロトコル [RFC4252] を用いて SSH のクライアント側の識別情報を検証する多数のメカニズムを提供している.

source: Generic and Common Textual Conventions used in this document can be found summarized at http://www.ops.ietf.org/mib-common-tcs.html
ja: この文書で用いる Generic and Common Textual Conventions は, http://www.ops.ietf.org/mib-common-tcs.html で要約されている.

source: In this case, if an error token is also sent (see below), then this message MUST be sent before the error token.
ja: この場合, エラートークンも送るならば(下記参照), このメッセージはエラートークンの前に送らなければならない.

source: While this is somewhat out of the scope of a protocol specification, it is described here anyway because some aspects of the protocol are specifically designed based on user interface issues, and omitting this information may lead to incompatible or awkward implementations.
ja: これはある意味プロトコルの仕様外の話だ. しかし, このプロトコルはユーザインタファイスの問題に基いて仕様が設計されている面がありまたこの情報を除くと互換性がなかったり不恰好な実装を埋むかもしれないので, ここで記述することになった.

source: Internal names used to identify algorithms or protocols are normally never displayed to users, and must be in US-ASCII.
ja: アルトリズムやプロトコルを指定するのに使われる内部名は, 通常ユーザには表示されない. またUS-ASCIIでなければならない.

source: On the SSH client side of a connection:
ja: 接続のSSHサーバ側では：

source: o The Connection Protocol [SSH-CONNECT] multiplexes the encrypted tunnel into several logical channels.
ja: o コネクションプロトコル [SSH-CONNECT] は暗号化されたトンネルをいくつかの論理的なチャンネルに多重化する.

source: Clients MAY make use of a mapping provided by local configuration or use other secure means to determine the targ_name to be used.
ja: クライアントは, ローカルな設定で提供されるマッピングを利用したり, 用いられる targ_name を決定する他の安全な方法を利用したりしてよい.

source: Language tags are those described in [LANGTAG].
ja: language タグは [LANGTAG] に記述されているものだ.

source: As a result, USM utilizes a separate user and key- management infrastructure.
ja: 結果として, USM は独立したユーザと鍵管理基盤を利用する.

source: Create a tmStateReference cache for subsequent reference to the information.
ja: 情報を後で参照できるように tmStateReference のキャッシュを作成する.

source: This document does not specify any standard data to be used as channel bindings, and the use of network addresses as channel bindings may break SSH in environments where it is most useful.
ja: チャンネル束縛として用いられる標準データをこの文書は指定しない. また, チャンネル束縛としてネットワークアドレスを利用すると, それがもっとも有用な環境において, SSHを壊してしまうかもしれない.

source: A public key verified using this method MUST NOT be trusted if the SSHFP resource record (RR) used for verification was not authenticated by a trusted SIG RR.
ja: 信頼できるIG RRによって SSHFP リソースレコード（ＲＲ）が認証されていなければ, この方法を用いて検証された公開鍵は, 信用してはならない.

source: Rationale
ja: 原理

source: Requests for assignments of new message numbers in the range of 1 to 29, 50 to 59, and 80 to 127 MUST be done through the STANDARDS ACTION method, as described in [RFC2434].
ja: 1 から 29, 50 から 59, 80から 127 の範囲に新たなメッセージ番号を割り当てる要求は, [RFC2434] に記述されている STANDARDS ACTION におってされなければならない.

source: The reader is directed to the security considerations sections of [RFC5280] for the use of X.509v3 certificates, [RFC2560] for the use of OCSP response, [RFC4253] for server authentication, and [RFC4252] for user authentication.
ja: X.509v3 証明書の利用について [RFC5280], OCSP 応答について [RFC2560], サーバ認証について [RFC4253], ユーザ認証について [RFC4252] のセキュリティの考察の節を参照せよ.

source: The client invokes "snmp" as an SSH Subsystem, as indicated in the "subsystem" parameter.
ja: クライアントは, SSH のサブシステムとして, "subsystem" のパラメータとして指定して, "snmp" を起動する.

source: The following table lists the initial assignments of the 'service name' values.
ja: 次の表で, service_name の初期の割り当てを示す.

source: The 'encoded terminal modes' are described in Section 8.
ja: 'encoded terminal modes' は 8節で記述する.

source: Implementers SHOULD provide an administrative mechanism to control the proxy forwarding functionality so that site-specific security policies may be upheld.
ja: 実装者は, サイト特有のセキュリティポリシーが守られるようにプロキシ転送機能を成業する管理メカニズムを提供する必要がある.

source: However, the application may send EOF to whatever is at the other end of the channel.
ja: しかし, チャンネルの相手側が終了したときに, アプリケーションが EOF を送るかもしれない.

source: An example of a locally defined name is "our-attribute@example.com" (without the double quotes).
ja: ローカルに定義される名前の例の1つは, "our-attribute@example.com" (ダブルクォーテーションを除く) だ.

source: As described in [SSH-Tran], the SSH_MSG_KEXINIT packet has the following structure:
ja: [SSH-Tran] で記述されているように, SSH_MSG_KEXINIT パケットは次の構造を持つ.

source: Confidentiality and Data Integrity of SSH Binary Packets .......12 6.1.
ja: SSH バイナリパケットの機密性とデータ完全性 .......12 6.1.

source: It is because of these birthday attacks that implementors are highly encouraged to use secure block ciphers with large block lengths.
ja: これらの誕生日攻撃のために, 実装者は長いブロック長の安全なブロック暗号を使うことが推奨される.

source: It is RECOMMENDED that the warning provide sufficient information to the user of the client device so the user may make an informed decision.
ja: クライアントデバイスは, ユーザが情報に基づく決定ができるように, 警告にユーザに対する十分な情報を提供することが推奨される.

source: Having performed the encryption, the client sends:
ja: 暗号化を行なったら, クライアントは以下を送る:

source: Information Responses
ja: 情報の応答

source: Conventions ................................................3 1.3.
ja: 規約 ................................................3 1.3.

source: For example, the padding, SSH_MSG_IGNORE messages, and several other places in the protocol can be used to pass covert information, and the recipient has no reliable way of verifying whether such information is being sent.
ja: たとえば, パディングやSSH_MSG_IGNOREメッセージや, またプロトコル中のいくつかの部分は, コバートチャンネルを転送するのに利用できる. 受け取り手には, そのような情報が送られたかどうかを検証する信頼できる方法はない.

source: In the event that a GSS-API error occurs on the server during context establishment, the server MAY send the following message to inform the client of the details of the error before sending an SSH_MSG_USERAUTH_FAILURE message:
ja: コンテキストの確立の間にサーバで GSS-APIエラーが起きたら, SSH_MSG_USERAUTH_FAILURE メッセージを送る前に, エラーの詳細をクライアントに示すため次のメッセージをサーバは送ってもよい.

source: 8 VSTART Continues paused output (normally control-Q).
ja: 8 VSTART 中断した出力を再開する(通常は control-Q).

source: IANA has created and maintains a registry of these header-tags.
ja: IANA は これらの header-tags のレジストリを作成し管理している.

source: The purpose of this document is to show how GCM with either AES-128 or AES-256 can be integrated into the Secure Shell Transport Layer Protocol [RFC4253].
ja: この文書の目的は, AES-128 もしくは AES-256 と GCM の組合せを, セキュアシェルトランスポート層プロトコル [RFC4253] に統合する方法を示すことだ.

source: Output from Key Exchange
ja: 鍵交換からの出力

source: Where distinction is required, the application names of command generator, command responder, notification originator, notification receiver, and proxy forwarder are used.
ja: 区別が必要な場合は, 以下のアプリケーション名を用いる: コマンドジェネレータ, コマンドレスポンダー, 通知オリジネータ, 通知レシーバ, プロキシフォワーダ.

source: If the server simply assumed success on the part of the client and completed the authentication service, it is possible that the client would fail to complete the authentication method, but not be able to retry other methods because the server had already moved on.
ja: サーバが単にクライアントの部分の成功を仮定し認証サービスを終了させたら, クライアントは認証法を失敗させられる. しかし サーバがすでに認証成功としているので別の認証法を試すことはできない.

source: The SSH Transport Model simply trusts that these are properly configured by the implementer and deployer.
ja: SSH トランスポートモデルは, 実装者と配置者によって適切に設定されていることを単純に信じる.

source: Implementers are free to implement differently.
ja: 実装者は異なった実装をする自由がある.

source: These tunnels are initialized using the secure shell key exchange protocol as described in Section 7 of [RFC4253].
ja: これらのトンネルは, [RFC4253] の7節で記述されているセキュアシェル鍵交換プロトコルを用いて初期化される.

source: Future Assignments .
ja: 将来の割り当て .

source: These algorithms rely on two counters:
ja: これらのアルゴリズムは2つのカウンタに依存する:

source: The server SHOULD take into consideration that some clients may not be able to properly display a long name or prompt field (see next section), and limit the lengths of those fields if possible.
ja: サーバは, クライアントが長い name や prompt フィールドを適切に表示できない可能性を考慮する必要がある(次の節を参照). 可能ならばこれらのフィールドの流さを制限する必要がある.

source: Unlike the Diffie-Hellman key-exchange method defined by [RFC4253], this method allows the client to fully determine the shared secret, K. This is believed not to be significant, since K is only ever used when hashed with data provided in part by the server (usually in the form of the exchange hash, H).
ja: [RFC4253] で定義されている Diffie-Hellman 鍵交換法と異なり, この方法はクライアントが完全に共有の秘密 K を決定できる. (通常は交換ハッシュ H の形式で)サーバから一部が与えられるデータと共にハッシュ化してKは用いられるので, これは重大ではないと考えられている.

source: It is believed (see, for example, Section B.2.1 of [SEC1]) that when curve parameters are generated at random, the curves will be resistant to special attacks, and must rely on the most general attacks.
ja: 曲線パラメータをランダムに生成すると, 曲線は特有の攻撃に耐性を持ちもっとも一般的な攻撃だけが有効になると信じられている.(例えば, [SEC1] のB.2.1節を参照).

source: The following table identifies the initial assignments of the Compression Algorithm names.
ja: 次の表で, 圧縮アルゴリズムの名前の初期の割り当てを示す.

source: Abstract Service Interfaces have been defined by [RFC3411] and further augmented by [RFC5590] to describe the conceptual data flows between the various subsystems within an SNMP entity.
ja: 抽象サービスインタフェイス (Abstract Service Interfaces) は SNMP エンティティの中で様々なサブシステム間の概念的なデータフローを記述するために [RFC3411] で定義され [RFC5590] で増補されている.

source: Protocol Exchanges
ja: プロトコルのやりとり

source: Once the user has been successfully authenticated, the SSH client will invoke the "ssh-connection" service, also known as the SSH connection protocol.
ja: ユーザが認証に成功したら, クライアントは SSHコネクションプロトコルとして知られている "ssh-connection" サービスを起動する.

source: End-of-Message Framing Mechanism .
ja: メッセージ終了文字列を用いるフレーミングメカニズム .

source: One possibility is to use the name field (possibly prefixed with the application's name) as the title of a dialog window in which the prompt(s) are presented.
ja: 一つの方法は, promptの表示するダイアログウィンドウのタイトルとして, name フィールドを用いることだ(アプリケーション名を前置するかもしれない).

source: The transformation between elliptic curve points and octet strings is specified in Sections 2.3.3 and 2.3.4 of [SEC1]; point compression MAY be used.
ja: 楕円曲線の点と8bit文字列との変換は, [SEC1]の2.3.3と2.3.4節で指定されている; 点の圧縮が利用されるかもしれない.

source: The server MUST always reject this request, unless the client is to be granted access without any authentication, in which case, the server MUST accept this request.
ja: サーバは, この要求を常に拒否しなければならない. ただし, クライアントが認証なしで正当なアクセスができる場合に限っては, サーバはこの要求を受け入れなければならない.

source: An example of this is stderr data from interactive sessions.
ja: この例として, インタラクティブなセッションからの stderr データがある.

source: SSH sessions resulting from a key exchange using the diffie-hellman methods described in the section Diffie-Hellman Key Exchange of [SSH-TRANS] (including "diffie-hellman-group1-sha1" and "diffie-hellman-group14-sha1") are secure even if private keying/authentication material is later revealed, but not if the session keys are revealed.
ja: ( "diffie-hellman-group1-sha1" と "diffie-hellman-group14-sha1" が含まれている)[SSH-TRANS]の Diffie-Hellman 鍵交換の節で記述されている diffie-hellman 法を用いる鍵交換を使ったSSHのセッションは, 共有鍵の生成法や認証の情報があとで漏れても安全だが, セッション鍵が漏れた場合は安全ではない.

source: In particular, this means that K_T should not be used as a host key, or as a server key in earlier versions of the SSH protocol.
ja: 特に, これは K_T をホスト鍵として利用してはならない, またSSHプロトコルの以前のバージョンのサーバ鍵として利用してはならないということを意味している.

source: While in many environments the information conveyed by this header data may be considered innocuous public information, it may constitute a channel through which information about a user, a key, or its use may be disclosed intentionally or otherwise (e.g., "Comment: Mary E. Jones, 123 Main St, Home Phone:...").
ja: 多くの環境ではこのヘッダデータに格納される情報は無害な公開情報だと考えられるが, 意図的またはその他の方法で開示されうるユーザや鍵や鍵の利用についての情報を通すチャンネルを構築するかもしれない. (例, "Comment: Mary E. Jones, 123 Main St(住所), 自宅の電話番号:...").

source: Since the protocol being defined in this set of documents is version 2.0, the 'protoversion' MUST be "2.0".
ja: この文書群で定義されるプロトコルはバージョン.2.0 なので, 'protoversion'は 2.0 でなければならない.

source: The maximum packet size is negotiated separately for each channel.
ja: 最大のパケットサイズはそれぞれのチャンネルで独立に取り決められる.

source: This protocol assumes that it is run over a secure channel and that the endpoints of the channel have been authenticated.
ja: このプロトコルは, 安全なチャンネル上で動作することとそのチャンネルの末端が認証されていることを前提としている.

source: In practice however, it is RECOMMENDED that the same algorithm be used in both directions.
ja: しかしながら実際上は, どちらの方向でも同じアルゴリズムを用いることが推奨される.

source: Negative numbers have the value 1 as the most significant bit of the first byte of the data partition.
ja: 負の数は, データパーティションの最初のバイトの最上位ビットに1を持つ.

source: The certificate part may be a zero length string, but a public key is required.
ja: certificate の部分は 長さ0の string の場合ががある. 一方 public key は必須だ.

source: As described in [SSH-Tran], the exchange of SSH_MSG_KEXINIT between the server and the client establishes which key agreement algorithm, MAC algorithm, host key algorithm (server authentication algorithm), and encryption algorithm are to be used.
ja: [SSH-Tran] で記述されているように, サーバとクライアント間での SSH_MSG_KEXINIT の交換が, 鍵合意アルゴリズムや, MAC アルゴリズム, ホスト鍵アルゴリズム (サーバ認証アルゴリズム), 暗号化アルゴリズムのそれぞれで何が用いられるかを確立する.

source: MIB Module Security .......................................32 10.
ja: MIB モジュールのセキュリティ .......................................32 10.

source: The guess is considered wrong if:
ja: 推測は以下の場合に間違っていると考えられる:

source: The remote command may also terminate violently due to a signal.
ja: リモートのコマンドは, シグナルによって強制的に終了されるかもしれない.

source: Algorithm Negotiation .....................................17 7.2.
ja: アルゴリズムのネゴシエーション........................17 7.2.

source: Earlier versions of this protocol have not been formally documented, but it is widely known that they use 'protoversion' of "1.x" (e.g., "1.5" or "1.3").
ja: このプロトコルのより以前のバージョンについては公式に文書化されていないが, より以前のバージョンは 'protoversion' に "1.x" (たとえば, "1.5" or "1.3") を利用していたことが広く知られている.

source: Connection Protocol Subsystem Names
ja: コネクションプロトコルのサブシステムの名前

source: The "rsa1024-sha1" method specifies RSA key exchange as described above with the following parameters:
ja: "rsa1024-sha1" 法は, 次のパラメータで以上で記述した RSA 鍵交換を指定する.

source: Note that there is no LineFeed character after the <rpc> end tag in this message.
ja: このメッセージの <rpc> の終了タグの後にラインフィード文字がないことに注意.

source: It is assumed that practitioners will first attempt to use the IANA assigned 'reason code' values and then document their locally assigned 'reason code' values.
ja: 実行する者が, まずIANAで割り当てられた 'reason code' を利用しようとし, その次にローカルに割り当てられた 'reason code' を利用しようとすることを前提としている.

source: Null Host Key Algorithm ........................................20 6.
ja: null ホスト鍵アルゴリズム ........................................20 6.

source: Incoming messages for the session MUST be associated with this tmSecurityName value.
ja: セッションの受信メッセージは, この tmSecurityName の値に関連していなければならない.

source: ECDH Message Numbers ......................................13 7.2.
ja: ECDH メッセージ番号 ......................................13 7.2.

source: This section makes two recommendations.
ja: この節は, 2つの推奨からなる.

source: The "none" Authentication Request
ja: "none" 認証要求

source: Thus, the client could first send an SSH_MSG_USERAUTH_REQUEST for one GSS-API mechanism, then try public key authentication, and then try another GSS-API mechanism.
ja: つまり， クライアントは最初に ある GSS-API メカニズム についての SSH_MSG_USERAUTH_REQUEST を送り， 次に公開鍵認証を試し， そして 別の GSS-API メカニズムを試すことができる．

source: Family 2 only (min_LOS 128 or 192): kex_algorithm name_list := { ecdh_sha2_nistp384 } encryption_algorithm name_list := { AEAD_AES_256_GCM } mac_algorithm name_list := { AEAD_AES_256_GCM }
ja: ファミリー 2 のみ (min_LOS 128 or 192): kex_algorithm name_list := { ecdh_sha2_nistp384 } encryption_algorithm name_list := { AEAD_AES_256_GCM } mac_algorithm name_list := { AEAD_AES_256_GCM }

source: This presents a problem for SSH AES-GCM because:
ja: これは, SSH AES-GCM では問題となる:

source: If the client does not support the "gssapi-keyex" user authentication method described in Section 4, or does not intend to use that method in conjunction with the GSS-API context established during key exchange, then anon_req_flag SHOULD be set to "true".
ja: クライアントが 4節で記述する "gssapi-keyex" ユーザ認証をサポートしていなかったり, 鍵交換時に確立した GSS-APIコンテクストと連携した方法を使おうとしない場合は, anon_req_flag は "true" に設定する必要がある.

source: Two REQUIRED key exchange methods have been defined:
ja: 2つの要求されている鍵交換法が定義されている:

source: The "3des-ctr" method uses three-key triple-DES (encrypt-decrypt- encrypt), where the first 8 bytes of the key are used for the first encryption, the next 8 bytes for the decryption, and the following 8 bytes for the final encryption.
ja: "3des-ctr" は 3つの鍵を用いる トリプルDES (encrypt-decrypt-encrypt) を使う. 鍵の最初の8byteを最初の暗号化に, 次の8byteを復号に, 続く8byteを最後の暗号化に用いる.

source: Key exchange will begin immediately after sending this identifier.
ja: この識別子を送ったらすぐに鍵交換が始まる.

source: Session State
ja: セッション状態

source: If the public key of the server had been securely distributed to the client prior to that session initiation, the key offered to the client by the attack device will not match the key stored on the client.
ja: セッションの開始の前にサーバの公開鍵が安全にクライアントに配布されていれば, 攻撃用のデバイスがクライアントに提供した鍵とクライアイントが保持している鍵とが一致しない.

source: The width of the integer fields is determined by the curve being used.
ja: 整数のフィールドの大きさは, 利用する曲線によって決定される.

source: One alternative to recommendation (1) would be to make the SSH Transport Protocol's sequence number more than 32 bits long.
ja: 推薦 (1) の代替手段の1つに, SSHトランスポートプロトコルのシーケンス番号を 32bitよりも長くすることがある.

source: These packets contain the tokens produced from the 'GSS_Init_sec_context()' and 'GSS_Accept_sec_context()' calls.
ja: これらのパケットは， 'GSS_Init_sec_context()' と 'GSS_Accept_sec_context()' の呼び出しから生成されたトークンを含む．

source: The calling code should release the associated tmStateReference.
ja: 呼び出し元のコードは, 関連すう tmStateReference 開放する必要がある.

source: The Generic Security Service Application Program Interface (GSS-API) provides security services to callers in a mechanism-independent fashion.
ja: 汎用セキュリティサービスアプリケーションプログラムインタフェイス (GSS-API) はメカニズムに依存しない形式でセキュリティサービスを呼び出し側に提供する.

source: This memo also defines a new host public key algorithm that can be used when no operations are needed using a host's public key, and a new user authentication method that allows an authorization name to be used in conjunction with any authentication that has already occurred as a side-effect of GSS-API-based key exchange.
ja: このメモは, ホスト公開鍵の利用になにも操作が必要ではない新しいホスト公開鍵アルゴリズムも定義する. さらに, GSS-APIベースの鍵交換の副作用として生じたどの認証に対しても連携して利用できる新しいユーザ認証法も定義する.

source: The numbers 30-49 are specific to key exchange and may be redefined by other kex methods.
ja: 30-49 の範囲の数は鍵交換特有のもので, 他の鍵交換法で再定義できる.

source: The 'softwareversion' string is primarily used to trigger compatibility extensions and to indicate the capabilities of an implementation.
ja: 'softwareversion' は, 主に互換性のための拡張を動作させたり, 実装の能力を示すために使われる.

source: Responses to Authentication Requests .......................5 5.2.
ja: 認証の要求に対する返答.......................5 5.2.

source: The server MUST check that the key is a valid authenticator for the user, and MUST check that the signature is valid.
ja: サーバは, 鍵がユーザの正当な認証情報かどうかをチェックしなければならない. また, 署名が正当かチェックしなければならない.

source: Galois/Counter Mode .......................................12 6.2.
ja: Galois(ガロア)/カウンタモード .......................................12 6.2.

source: Any other channel- related messages contain the recipient's channel number for the channel.
ja: それ以外のチャンネルに関するメッセージは, そのチャンネルの受け取り手のチャンネル番号を含む.

source: 6 VEOL End-of-line character in addition to carriage return and/or linefeed.
ja: 6 VEOL キャリッジリターンと/もしくはラインフィードに追加される End-of-line 文字

source: In AES-GCM secure shell, the inputs to the authenticated encryption are:
ja: AES-GCM セキュアシェルで, 認証付き暗号化の入力は以下だ:

source: These numbers are allocated as follows:
ja: この番号は次のように割当てられる:

source: If L is at least 128, then, after rekeying, an SSH implementation SHOULD NOT encrypt more than 2**(L/4) blocks before rekeying again.
ja: L が128以上の場合, 鍵の再発行の後でもう一度再発行するまでの間にSSHの実装は 2**(L/4)ブロック以上の暗号化をしないほうがよい.

source: The authentication starts with the client sending the following packet:
ja: 認証は, クライアントが次のパケットを送ることで始まる.
